config.org
#+PROPERTY: header-args :tangle yes :results none
#+STARTUP: overview

* init
#+begin_src emacs-lisp
;;;;; SETTINGS ;;;;;
;;;;;

(setq! doom-theme 'doom-one
       dracula-enlarge-headings nil
       markdown-hide-urls t
       eldoc-idle-delay 100
       windmove-wrap-around t
       confirm-kill-emacs nil
       auto-revert-verbose nil
       user-full-name "mr big"
       doom-localleader-key "m"
       text-scale-mode-step 1.06
       display-line-numbers-type nil
       pabbrev-idle-timer-verbose nil
       user-mail-address "mrbig033@protonmail.com"
       bookmark-default-file "~/.doom.d/lisp/bookmarks"
       flycheck-global-modes '(not emacs-lisp-mode lisp-interaction-mode)
       header-line-format "  " ;; source: https://bit.ly/2tdnkkh
       ;; doom-scratch-initial-major-mode 'my-lisp-interaction-mode
       doom-variable-pitch-font (font-spec :family "sans" :size 28)
       bitly-access-token "3026d7e8b1a0f89da10740c69fd77b4b3293151e"
       doom-font (font-spec :family "monospace" :size 27 :weight 'semi-light))

(add-to-list 'display-buffer-alist
             '("*info*" display-buffer-same-window))

(put 'customize-group 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'scroll-left 'disabled nil)

(load-file "~/.doom.d/lisp/cool-moves/cool-moves.el")
(mouse-avoidance-mode 'banish)
(global-auto-revert-mode t)
;; (global-pabbrev-mode t)
#+end_src
* hooks
#+begin_src emacs-lisp
;;;; REMOVE HOOKS ;;;;;
(remove-hook! '(org-mode-hook
                text-mode-hook
                ;; prog-mode-hook
                ) hl-line-mode)

(remove-hook! 'evil-visual-state-exit-hook 'doom-enable-hl-line-maybe-h)
;;;; ADD HOOKS ;;;;;
(add-hook! '(prog-mode-hook
             text-mode-hook
             org-mode-hook
             helpful-mode-hook
             conf-mode-hook) #'olivetti-mode)
(add-hook! 'text-mode-hook
           #'electric-operator-mode
           #'abbrev-mode)

(add-hook! '(server-after-make-frame-hook
             ;; doom-first-buffer-hook
             ) #'my-new-frame-settings)


;;;; MAKE SCRIPTS EXECUTABLE ;;;;;
;; source: https://bit.ly/31ZDduV
(add-hook 'after-save-hook
          'executable-make-buffer-file-executable-if-script-p)
#+end_src
* functions
** text
#+begin_src emacs-lisp
(defun my-deer-goto-tmp ()
  (interactive)
  (deer "~/.doom.d/tmp/"))

(defun my-comment-line ()
  (interactive)
  (save-excursion
    (comment-line 1)))

(defun my-indent-buffer-save-excursion ()
  (interactive)
  (save-excursion
    (let ((inhibit-message t))
      (evil-indent
       (point-min)
       (point-max)))))

(defun my-indent-buffer ()
  (interactive)
  (let ((inhibit-message t))
    (evil-indent
     (point-min)
     (point-max))))

(defun my-backward-kill-line (arg)
  "Kill ARG lines backward."
  (interactive "p")
  (kill-line (- 1 arg)))

(defun my-sort-lines-by-length (reverse beg end)
  "sort lines by length."
  (interactive "p\nr")
  (save-excursion
    (save-restriction
      (narrow-to-region beg end)
      (goto-char (point-min))
      (let ;; to make `end-of-line' and etc. to ignore fields.
          ((inhibit-field-text-motion t))
        (sort-subr reverse 'forward-line 'end-of-line nil nil
                   (lambda (l1 l2)
                     (apply #'< (mapcar (lambda (range) (- (cdr range) (car range)))
                                        (list l1 l2)))))
        (reverse-region beg end)))))

(defun endless/simple-get-word ()
  (car-safe (save-excursion (ispell-get-word nil))))

(defun endless/ispell-word-then-abbrev (p)
  "Call `ispell-word', then create an abbrev for it.
      With prefix P, create local abbrev. Otherwise it will
      be global.
      If there's nothing wrong with the word at point, keep
      looking for a typo until the beginning of buffer. You can
      skip typos you don't want to fix with `SPC', and you can
      abort completely with `C-g'."
  (interactive "P")
  (let (bef aft)
    (save-excursion
      (while (if (setq bef (endless/simple-get-word))
                 ;; Word was corrected or used quit.
                 (if (ispell-word nil 'quiet)
                     nil ; End the loop.
                   ;; Also end if we reach `bob'.
                   (not (bobp)))
               ;; If there's no word at point, keep looking
               ;; until `bob'.
               (not (bobp)))
        (backward-word)
        (backward-char))
      (setq aft (endless/simple-get-word)))
    (if (and aft bef (not (equal aft bef)))
        (let ((aft (downcase aft))
              (bef (downcase bef)))
          (define-abbrev
            (if p local-abbrev-table global-abbrev-table)
            bef aft)
          (message "\"%s\" now expands to \"%s\" %sally"
                   bef aft (if p "loc" "glob")))
      (user-error "No typo at or before point"))))

(defun my-search-settings ()
  (interactive)
  (counsel-ag nil "~/.doom.d/" "-f -G 'config.org\|init.el\|packages.el'"))
#+end_src
