config.org
** misc
#+begin_src emacs-lisp
;; org src buffer name
(defun my-org-edit-special ()
  (interactive)
  (org-edit-special)
  (my-recenter-window))

(defun my-evaluate-next-sexp ()
  (interactive)
  (lispy-forward 1)
  (eros-eval-last-sexp nil))

(defun my-switch-to-scratch ()
  (interactive)
  (switch-to-buffer "~/.doom.d/tmp/sct.el*"))


(defun my-delete-frame ()
  (interactive)
  (delete-frame))

(defun my-save-buffer ()
  (interactive)
  (let ((inhibit-message t))
    (evil-ex-nohighlight)
    (save-buffer)))

(defun my-just-save-buffer-quiet ()
  (interactive)
  (let ((inhibit-message t))
    (save-buffer)))
(defun my-show-package-commands ()
  (interactive)
  (counsel-M-x "^package-"))

(defun my-show-info-commands ()
  (interactive)
  (counsel-M-x "^Info "))

(defun my-show-server-commands ()
  (interactive)
  (counsel-M-x "^server-"))

(defun my-force-normal-state ()
  (interactive)
  (evil-ex-nohighlight)
  (evil-force-normal-state))

(defun my-eval-buffer ()
  (interactive)
  (my-save-buffer)
  (eval-buffer)
  (message " buffer evaluated"))

(defun my-sel-to-end ()
  (interactive)
  (evil-visual-char)
  (evil-last-non-blank))

(defun my-yank-dirname-as-kill ()
  "Source: https://stackoverflow.com/a/53075288
   Copy the current directory into the kill ring."
  (interactive)
  (kill-new default-directory)
  (message default-directory))

(defun xah-clean-empty-lines ()
  "replace repeated blank lines to just 1."
  (interactive)
  (let ($begin $end)
    (if (region-active-p)
        (setq $begin (region-beginning) $end (region-end))
      (setq $begin (point-min) $end (point-max)))
    (save-excursion
      (save-restriction
        (narrow-to-region $begin $end)
        (progn
          (goto-char (point-min))
          (while (re-search-forward "\n\n\n+" nil "move")
            (replace-match "\n\n")))))))

(defun my-rename-file-and-buffer ()
  "Rename the current buffer and file it is visiting.
   Source: https://bit.ly/31X6KWk."
  (interactive)
  (let ((filename (buffer-file-name)))
    (if (not (and filename (file-exists-p filename)))
        (message "Buffer is not visiting a file!")
      (let ((new-name (read-file-name "New name: " filename)))
        (cond
         ((vc-backend filename) (vc-rename-file filename new-name))
         (t
          (rename-file filename new-name t)
          (set-visited-file-name new-name t t)))))))

;; Get focus even with focus stealing prevention
;; Source: https://bit.ly/37XClem
(defun my-new-frame-settings ()
  (select-frame-set-input-focus (selected-frame))
  (toggle-frame-maximized))

(defun my-show-server-name ()
  (interactive)
  (helpful-variable 'server-name))

(defun my-show-major-mode ()
  (interactive)
  (helpful-variable 'major-mode))

;;;;; MODES ;;;;;
(define-derived-mode my-lisp-interaction-mode
  lisp-interaction-mode "my-lim")

(define-derived-mode scratch-mode
  text-mode "my-scratch")

(define-derived-mode my-markdown-mode
  markdown-mode "my-md")

(define-derived-mode my-fundamental-mode
  markdown-mode "my-fund")

(define-derived-mode my-text-mode
  markdown-mode "my-txt")

(define-derived-mode my-org-mode
  org-mode "my-org")

(defun my-bash-shebang ()
  (interactive)
  (erase-buffer)
  (insert "#!/usr/bin/env bash\n\n\n\n\n\n\n\n\n\n\n")
  (sh-mode)
  (sh-set-shell "bash")
  (xah-clean-empty-lines)
  (forward-to-indentation)
  (evil-insert-state)
  (my-just-save-buffer-quiet))

(defun my-python-shebang ()
  (interactive)
  (kill-region (point-min) (point-max))
  (insert "#!/usr/bin/env python3\n\n")
  ;; (insert "\"\"\" Docstring \"\"\"")
  ;; (insert "\n\n")
  (evil-insert-state))

(defun my-find-elisp-tmp ()
  (interactive)
  (find-file "~/.doom.d/tmp/tmp.el"))

(defun my-find-elisp-tmp-other-window ()
  (interactive)
  (find-file-other-window "~/.doom.d/tmp/tmp.el"))

(defun my-edit-hosts ()
  (interactive)
  (doom/sudo-find-file "/etc/hosts"))

(fset 'my-org-capture-todo-macro
      (kmacro-lambda-form [?\M-x ?c ?o ?u ?n ?s return ?T ?o ?d ?o return escape ?\M-k ?\M-j ?i ? ] 0 "%d"))

(defun my-tangle-py-config ()
  (interactive)
  (start-process-shell-command "tangle config.org"
                               nil
                               "~/dotfiles/maps/scripts/emacs-tangle-init")
  (message " init tangled"))

(defun my-tangle-py-config-quiet ()
  (interactive)
  (start-process-shell-command "tangle config.org"
                               nil
                               "~/dotfiles/maps/scripts/emacs-tangle-init"))
(defun my-recenter-window ()
  (interactive)
  (recenter-top-bottom
   `(4)))
#+end_src
* keybindings
