config.el
(map! :map (evil-org-mode-map org-mode-map)
      :i "C-l"                                     'pabbrev-expand-maybe
      :n "<backspace>"                             'org-edit-special
      :n "zi"                                      'org-show-all
      :nvieg "M-m"                                 'my-org-edit-special
      :n "C-j"                                     'org-shiftleft
      :n "C-k"                                     'org-shiftright
      :i "C-k"                                     'kill-line
      "C-ç"                                        'counsel-outline
      "C-M-k"                                      'org-metaup
      "C-M-j"                                      'org-metadown
      "C-k"                                        'org-shiftleft
      "C-c b"                                      'org-cycle-list-bullet
      "C-c C-s"                                    'org-emphasize
      :desc "Goto Clock"      :localleader "cs"    'org-clock-display
      ;; :desc "Display Clocked" :localleader "cg" 'org-clock-goto
      )

(map! :map (my-org-mode-map
            my-lisp-interaction-mode-map
            my-markdown-mode
            my-fundamental-mode
            my-text-mode
            my-org-mode)
      :n "<escape>" 'my-force-normal-state
      :n "q"        'quit-window)

;;;;; PROG AND TEXT;;;;;
(map! :map (prog-mode-map)
      :n "<tab>" 'outline-toggle-children
      :ni "C-c h" 'outline-hide-body
      :ni "C-c s" 'outline-show-all
      :ni "C-c o" 'outline-hide-other)

(map! :map (prog-mode-map text-mode-map conf-mode-map)
      :nvieg "<C-backspace>" 'my-comment-line)

(map! :map (occur-mode-map)
      :n "q" 'quit-window)

(map! :map (emacs-lisp-mode-map lisp-mode-map)
      :n "<C-return>" 'eros-eval-last-sexp
      :n "C-m" 'eros-eval-last-sexp
      :i "C-k"      'lispy-kill
      :nvieg "M-," 'evil-previous-open-paren
      :nvieg "M-." 'evil-next-close-paren
      :localleader "0" 'evil-next-close-paren
      :localleader "9" 'evil-previous-open-paren)

(map! :map (flycheck-mode-map)
      :nvieg "C-c f"    'flycheck-first-error)

(map! :map (text-mode-map
            prog-mode-map
            conf-mode-map)
      :n "<escape>"    'my-save-buffer)

(map! :map (pabbrev-mode-map)
      :i "C-9" 'pabbrev-expand-maybe)
;;;;; MISC ;;;;;
(map! :map (help-mode-map helpful-mode-map)
      :n "<escape>"    'my-force-normal-state)

(map! :map ranger-mode-map
      "q" 'ranger-close
      "<escape>" 'ranger-close
      :desc "Deer" :leader "r" 'deer)

(map! :map (ivy-minibuffer-map)
      "<C-return>" 'ivy-immediate-done)

(map! :map (ivy-minibuffer-map
            ivy-switch-buffer-map
            minibuffer-local-map
            read-expression-map)
      "C-,"      'ivy-previous-line
      "C-."      'ivy-next-line
      "C-k"      'kill-line
      "C-h"      'delete-backward-char)

(map! :map (Info-mode-map)
      :n "<escape>" 'my-force-normal-state
      :n "m"          'Info-menu
      :n "L"          'Info-history-forward
      :n "<right>"          'evil-forward-sentence-begin
      :n "<left>"          'evil-backward-sentence-begin
      ;; :n "<return>"          'Info-follow-nearest-node
      ;; :n "RET"          'Info-follow-nearest-node
      :n "q"          'ignore
      :n "C-n"          'Info-next
      :n "C-p"          'Info-prev
      :n "H"          'Info-history-back
      :n "ci"         'clone-indirect-buffer-other-window
      :n "<C-return>" 'eros-eval-last-sexp
      :n "M-n"        'forward-paragraph)

(map! :map override
      :nv "f"                                'avy-goto-char-2-below
      :nv "F"                                'avy-goto-char-2-above
      :n "C-s"                               '+default/search-buffer
      :i "C-u"                               'my-backward-kill-line
      :n "gr"                                'my-sel-to-end
      :n "ge"                                'evil-end-of-visual-line
      :n "M-e"                               'evil-forward-sentence-begin
      :n "M-a"                               'evil-backward-sentence-begin
      :n "0"                                 'evil-beginning-of-visual-line
      :n "g0"                                'evil-digit-argument-or-evil-beginning-of-line
      :n "!"                                 'my-delete-frame
      :n "Q"                                 'my-delete-frame
      :i "C-d"                               'delete-char
      :i "C-h"                               'delete-backward-char
      :i "C-n"                               'next-line
      :i "C-p"                               'previous-line
      :i "C-e"                               'move-end-of-line
      :i "C-a"                               'move-beginning-of-line
      :ni "<M-return>"                       'my-indent-buffer
      :nvieg "<f8>"                          'man
      :nvieg "C-c <f12>"                     'counsel-org-capture
      :nvieg "C-c m"                         'evil-record-macro
      :nvieg "C-S-j"                         'cool-moves/line-forward
      :nvieg "C-S-k"                         'cool-moves/line-backward
      :nvieg "M-y"                           'counsel-yank-pop
      :nvieg "M-9"                           'delete-window
      :nvieg "M-0"                           'quit-window
      :nvieg "C-0"                           'doom/window-maximize-buffer
      :nvieg "C-9"                           'doom/window-enlargen
      :nvieg "M--"                           'winner-undo
      :nvieg "M-="                           'winner-redo
      :nvieg "M-k"                           'windmove-up
      :nvieg "M-j"                           'windmove-down
      :nvieg "M-h"                           'windmove-left
      :nvieg "M-l"                           'windmove-right
      :nvieg "<M-up>"                        'windmove-up
      :nvieg "<M-down>"                      'windmove-down
      :nvieg "<M-left>"                      'windmove-left
      :nvieg "<M-right>"                     'windmove-right
      :desc "Capture"             :n "Ç"     'org-capture
      :desc "Capture Todo"        :n "ç" 'my-org-capture-todo-macro

      ;; :desc "Capture Goto Last"   :n "çl" 'org-capture-goto-last-stored
      ;; :desc "Capture Goto Target" :n "çt" 'org-capture-goto-target
      "C-c SPC"                              'caps-lock-mode
      "C-c q"                                'quick-calc
      "M-w"                                  'eyebrowse-next-window-config
      "M-q"                                  'eyebrowse-prev-window-config
      "C-c a"                                'align-regexp
      "C-'"                                  'org-cycle-agenda-files
      :nvieg "M-,"                           'projectile-next-project-buffer
      :nvieg "M-."                           'projectile-previous-project-buffer
      "<C-down>"                             'cool-moves/paragraph-forward
      "<C-up>"                               'cool-moves/paragraph-backward
      "C-S-j"                                'cool-moves/line-forward
      "C-S-k"                                'cool-moves/line-backward
      "C-S-n"                                'cool-moves/word-forward
      "C-S-p"                                'cool-moves/word-backwards)
