config.org
** unbind
#+begin_src emacs-lisp
(general-unbind '(scratch-mode-map my-org-mode-map)
  :with 'my-force-normal-state
  [remap my-save-buffer]
  [remap save-buffer])

(general-unbind 'normal lisp-interaction-mode-map
  :with 'ignore
  [remap my-save-buffer])

(general-unbind +doom-dashboard-mode-map
  :with 'forward-button
  [remap evil-better-visual-line-next-line])

(general-unbind +doom-dashboard-mode-map
  :with 'backward-button
  [remap evil-better-visual-line-previous-line])

(general-unbind +doom-dashboard-mode-map
  :with 'quit-window
  [remap evil-record-macro]
  [remap evil-force-normal-state])

(general-unbind +doom-dashboard-mode-map
  :with 'push-button
  [remap evil-forward-char])

(general-unbind 'lispyville-mode-map
  :with 'lispy-repeat
  [remap evil-repeat])

(general-unbind 'lispyville-mode-map
  :with 'evil-switch-to-windows-last-buffer
  [remap lispy-splice])

(general-unbind 'org-capture-mode-map
  :with 'org-capture-finalize
  [remap my-indent-buffer])

(general-unbind 'org-src-mode-map
  :with 'org-edit-src-exit
  [remap lispy-mark-symbol])
#+end_src
** misc
#+begin_src emacs-lisp
;; (define-key key-translation-map (kbd "s-(") (kbd "{"))
(define-key key-translation-map (kbd "<pause>") (kbd "C-c"))
(define-key key-translation-map (kbd "<menu>") (kbd "C-x"))

(map! :n "'"         'evil-goto-mark
      :n "`"         'evil-goto-mark-line
      :n "g."        'evil-repeat
      :n ","         'ivy-switch-buffer
      :n "."         'counsel-find-file
      :n "g4"         'evil-backward-word-end
      :i "M-/"       'hippie-expand
      :n "go"         'cool-moves/open-line-below
      :n "gO"         'cool-moves/open-line-above
      "M-s"                               'evil-switch-to-windows-last-buffer
      :i "C-k"                            'kill-line
      :nvieg "C-."   'my-search-settings
      :nvieg "C-,"   'helpful-at-point
      :nvieg "C-c i" 'insert-char
      "C-c r"        '+popup/raise
      "C-h m"        'my-show-major-mode
      "M-p"          'backward-paragraph
      "M-n"          'forward-paragraph)
#+end_src
* use-package
** org
*** org main
#+begin_src emacs-lisp
;; (use-package org-plus-contrib)
(use-package! org
  :init
  ;; (remove-hook 'org-mode-hook #'pabbrev-mode)
  (remove-hook 'org-cycle-hook 'org-optimize-window-after-visibility-change)
  (remove-hook 'org-mode-hook 'flyspell-mode)
  (add-hook! 'org-src-mode-hook 'my-indent-buffer)
  :custom
  (org-ellipsis ".")
  (org-clock-persist t)
  (org-clock-in-resume t)
  (org-log-into-drawer t)
  (org-directory "~/org/")
  (org-clock-into-drawer t)
  (org-clock-history-length 10)
  (org-clock-update-period 240)
  (org-startup-folded 'overview)
  (org-src-fontify-natively t)
  (org-src-tab-acts-natively t)
  (org-odt-fontify-srcblocks t)
  (org-fontify-done-headline t)
  (org-clock-mode-line-total 'auto)
  (org-clock-clocked-in-display nil)
  (org-clock-persist-query-resume t)
  (org-fontify-whole-heading-line nil)
  (org-edit-src-auto-save-idle-delay 1)
  (org-archive-location ".%s::datetree/")
  (org-fontify-quote-and-verse-blocks nil)
  (org-clock-out-remove-zero-time-clocks t)
  (org-clock-report-include-clocking-task t)
  (org-enforce-todo-checkbox-dependencies t)
  (org-src-ask-before-returning-to-edit-buffer nil)
  (org-clock-auto-clock-resolution 'when-no-clock-is-running)
  (org-todo-keywords '((sequence "TODO(t)" "STRT(s)" "|" "DONE(d)")))
  (org-drawers (quote ("properties" "logbook"))) ;; Separate drawers for clocking and logs
  :config

  ;; source: https://bit.ly/38iBxkd
  (defun org-src--construct-edit-buffer-name (org-buffer-name lang)
    (concat "[s] " org-buffer-name ""))

  (setq! system-time-locale "C"
         org-capture-templates
         '(("t" "Todo"
            entry
            (file+headline "~/org/agenda.org" "Todos")
            "* TODO %? %i" :prepend t)

           ("o" "Notes"
            entry
            (file+headline "~/org/agenda.org"  "Notes")
            "* %u %? %i" :prepend t)

           ("n" "Now"
            entry
            (file+headline "~/org/agenda.org"  "Now")
            "* %? %i" :prepend t)))
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines)))

(after! org
  (setq-default org-src-window-setup 'current-window))
#+end_src
*** org pomodoro
#+begin_src emacs-lisp
(use-package! org-pomodoro
  :after org
  :custom
  (org-pomodoro-offset 1)
  (org-pomodoro-audio-player "/usr/bin/paplay --volume=50768")
  (org-pomodoro-start-sound-args t)
  (org-pomodoro-length (* 25 org-pomodoro-offset))
  (org-pomodoro-short-break-length (/ org-pomodoro-length 5))
  (org-pomodoro-long-break-length (* org-pomodoro-length 0.8))
  (org-pomodoro-long-break-frequency 4)
  (org-pomodoro-ask-upon-killing nil)
  (org-pomodoro-manual-break nil)
  (org-pomodoro-keep-killed-pomodoro-time t)
  ;; (org-pomodoro-time-format "%.2m")
  (org-pomodoro-time-format "%.2m:%.2s")
  (org-pomodoro-short-break-format "SHORT: %s")
  (org-pomodoro-long-break-format "LONG: %s")
  (org-pomodoro-format "P: %s"))
  #+end_src
*** evil org
#+begin_src emacs-lisp
;;;;; source: https://bit.ly/3kE3Pcl ;;;;
(use-package! evil-org
  :config
  (remove-hook 'org-tab-first-hook '+org-cycle-only-current-subtree-h)
  (add-hook 'org-cycle-hook 'org-cycle-hide-drawers))
#+end_src
** company
#+begin_src emacs-lisp
(use-package! company
  :custom
  (company-show-numbers t)
  (company-idle-delay 0.2)
  (company-tooltip-limit 5)
  (company-minimum-prefix-length 2)
  (company-dabbrev-other-buffers t)
  (company-selection-wrap-around t)
  (company-auto-commit nil)
  (company-dabbrev-ignore-case 'keep-prefix)
  (company-global-modes '(not erc-mode
                              text-mode
                              org-mode
                              markdown-mode
                              message-mode
                              help-mode
                              gud-mode
                              eshell-mode))

  :general
  (:keymaps '(company-active-map)
   ;; "<return>" nil
   ;; "TAB"      nil
   "C-h"    'backward-delete-char
   "M-q"    'company-complete-selection
   "C-d"    'counsel-company
   "M-y"    'my-company-yasnippet
   "M-p"    'my-company-comp-with-paren
   "M-."    'my-company-comp-with-dot
   "M-SPC"  'my-company-comp-space
   "C-u"    'my-backward-kill-line
   "M-0"    'company-complete-number
   "M-1"    'company-complete-number
   "M-2"    'company-complete-number
   "M-3"    'company-complete-number
   "M-4"    'company-complete-number
   "M-5"    'company-complete-number
   "M-6"    'company-complete-number
   "M-7"    'company-complete-number
   "M-8"    'company-complete-number
   "M-9"    'company-complete-number)

  :config

  (defun my-company-yasnippet ()
    (interactive)
    (company-abort)
    (yas-expand))

  (defun my-company-comp-with-paren ()
    (interactive)
    (company-complete-selection)
    (insert "()")
    (backward-char))

  (defun my-company-comp-with-dot ()
    (interactive)
    (company-complete-selection)
    (insert ".")
    (company-complete))

  (defun my-company-comp-space ()
    (interactive)
    (company-complete-selection)
    (insert " ")))
#+end_src
