config.el

(use-package! super-save
  :custom
  (auto-save-default nil)
  (super-save-exclude '(".py"))
  (super-save-remote-files nil)
  (super-save-idle-duration 10)
  (super-save-auto-save-when-idle t)
  :config

  (setq super-save-triggers '(next-buffer
                              counsel-M-x
                              windmove-up
                              +eval/buffer
                              other-window
                              windmove-left
                              windmove-down
                              windmove-right
                              previous-buffer
                              org-edit-special
                              switch-to-buffer
                              org-edit-src-exit
                              eyebrowse-last-window-config
                              eyebrowse-next-window-config
                              eyebrowse-close-window-config
                              eyebrowse-create-window-config))

  (add-to-list 'super-save-hook-triggers 'find-file-hook)

  (defun super-save-command ()
    (when (and buffer-file-name
               (buffer-modified-p (current-buffer))
               (file-writable-p buffer-file-name)
               (if (file-remote-p buffer-file-name) super-save-remote-files t)
               (super-save-include-p buffer-file-name))
      (my-just-save-buffer-quiet)))

  (super-save-mode +1))


(use-package! ivy
  :custom
  ;; source:(https://bit.ly/32hmYcU)
  (swiper-use-visual-line nil)
  (ivy-height 15)
  (ivy-extra-directories nil)
  (counsel-outline-display-style 'title)
  (counsel-find-file-at-point t)
  (counsel-bookmark-avoid-dired t)
  (counsel-grep-swiper-limit 5000)
  (ivy-ignore-buffers '("^#.*#$"
                        "^\\*.*\\*"))
  :config
  (setq swiper-use-visual-line-p (lambda (a) nil)))

(use-package! evil
  :custom
  (evil-jumps-cross-buffers nil)
  (evil-respect-visual-line-mode t))

(use-package! evil-better-visual-line
  :config
  (evil-better-visual-line-on))

(use-package! which-key
  :custom
  (which-key-idle-delay 1.0))

(use-package! ranger
  :init
  (add-hook! 'ranger-mode-hook '(ranger-toggle-details olivett-mode))
  :custom
  (ranger-deer-show-details nil))

(use-package! avy
  :custom
  (avy-single-candidate-jump t))

(use-package! olivetti
  :hook (Info-mode . olivetti-mode)
  :init
  (setq-default olivetti-body-width '100))

(use-package! eyebrowse
  :custom
  (eyebrowse-wrap-around t)
  (eyebrowse-new-workspace t)
  :config
  (eyebrowse-mode +1))

(use-package! clipmon
  :config
  (clipmon-mode-start))

(use-package! info
  :init
  (remove-hook 'Info-mode 'olivetti)
  (remove-hook 'Info-mode-hook 'doom-modeline-set-info-modeline)
  :custom
  (info-lookup-other-window-flag nil))

(use-package! lispyville
  :config
  (defalias 'lispyville-yank 'evil-yank))

(use-package! hl-sentence
  :custom-face
  (hl-sentence ((t (:inherit hl-line)))))

(use-package! zoom
  :custom
  (zoom-size '(0.618 . 0.618)))
